backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."auth_token" = ? LIMIT ?  [["auth_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def load_current_user
        auht_header =  request.headers["Authorization"]
        raise STBAuthenticationError.new("no token") if auht_header.blank?
        bearer = auht_header.split.first
        raise STBAuthenticationError.new("bad format") if bearer != "Bearer"
        jwt = auht_header.split.last
        raise STBAuthenticationError.new("bad format") if jwt.blank?
        key = Rails.application.credentials.secret_key_base
        decoded = JWT.decode(jwt, key, 'HS256')
        payload = decoded.first
        if payload.blank? || payload["auth_token"].blank?
            raise STBAuthenticationError.new("bad token")
        end
        @current_user = User.find_by_auth_token(payload["auth_token"])
        raise STBAuthenticationError.new("bad token") if @current_user.blank?