backend/app/controllers/sessions_controller.rb

    def sign_up
        user = User.new(sign_up_params)
        if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "failed_attempts", "unlock_token", "locked_at", "created_at", "updated_at", "first_name", "last_name", "auth_token", "role") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def sign_in
        user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "supakjack@gmail.com"], ["LIMIT", 1]]

    def sign_out
       @current_user.generate_auth_token(true)
       @current_user.save
---
UPDATE "users" SET "updated_at" = ?, "auth_token" = ? WHERE "users"."id" = ?  [["updated_at", "2022-12-12 07:56:13.682658"], ["auth_token", "[FILTERED]"], ["id", 1]]

    def confirm
        user = User.find_by_confirmation_token(params[:confirmation_token]) # get confirmation_token from user.confirmation_token
---
SELECT "users".* FROM "users" WHERE "users"."confirmation_token" = ? LIMIT ?  [["confirmation_token", "[FILTERED]"], ["LIMIT", 1]]